## Plan changes
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`




**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 1 to add, 1 to change, 1 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # aws_ecs_cluster.covidshield will be updated in-place
  ~ resource "aws_ecs_cluster" "covidshield" {
        id                 = "arn:aws:ecs:ca-central-1:005133826942:cluster/CovidShield"
        name               = "CovidShield"
        tags               = {
            "CostCentre" = "CovidShield"
        }
        # (3 unchanged attributes hidden)

      + setting {
          + name  = "containerInsights"
          + value = "enabled"
        }
    }

  # aws_ecs_task_definition.covidshield_key_retrieval must be replaced
-/+ resource "aws_ecs_task_definition" "covidshield_key_retrieval" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:005133826942:task-definition/KeyRetrieval:273" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  + ulimits          = [
                      + {
                          + hardLimit = 65535
                          + name      = "nofile"
                          + softLimit = 65535
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (6 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "KeyRetrieval" -> (known after apply)
      ~ revision                 = 273 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 1 to add, 1 to change, 1 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>